In [30]:
import pandas as pd
from datetime import datetime as datetime
import datetime
import xlrd

In [59]:
df = pd.read_csv('./cities.csv')
# df = df.set_index('City')
df = df[['City','Country','Lat','Lng','Date','Max Temp','Humidity','Wind Speed','Cloudiness']]

,City,Country,Lat,Lng,Date,Max Temp,Humidity,Wind Speed,Cloudiness
0,jacareacanga,BR,-6.22,-57.76,1528902000,89.60,62,6.93,0
1,kaitangata,NZ,-46.28,169.85,1528905304,42.61,94,5.64,100
2,goulburn,AU,-34.75,149.72,1528905078,44.32,91,10.11,20
3,lata,IN,30.78,78.62,1528905305,59.89,89,0.94,76
4,chokurdakh,RU,70.62,147.90,1528905306,32.17,88,2.95,0
...,...,...,...,...,...,...,...,...,...
542,scalea,IT,39.82,15.79,1528905631,70.06,100,5.30,36
543,san andres,PH,13.32,122.68,1528905632,83.47,100,22.64,68
544,muisne,EC,0.61,-80.02,1528905633,76.90,84,4.63,92
545,ati,TD,13.21,18.34,1528905633,104.53,25,4.97,20
546,san luis,AR,-33.30,-66.34,1528905472,42.43,53,2.62,0

In [31]:
# def serial2yyyymmdd(serial):
#     base = datetime.datetime(1899, 12, 30)
#     delta = datetime.timedelta(days=serial)
#     tmstamp = str(base+delta)[0:10].replace("-",'')
#     return tmstamp

In [49]:
# for row in df.iterrows():
#     datething = row[1]['Date']
#     ack = serial2yyyymmdd(row[1]['Date']/100000)
#     print(datething)

In [60]:

html = df.to_html()
outfile = open('cities.html','w')
outfile.write(html)

134311